## Human Resources Analytics

### Data Modeling

#### Imports

In [2]:
import pandas as pd
import datetime
import glob
import math
from sqlalchemy.engine import create_engine

#### Conection with db

In [3]:
engine = create_engine('mysql+pymysql://root:bootcamp@127.0.0.1:3307/employees')

### Create columns **Satisfaction Level** and **Last_Evaluation**.

#### Load performance evaluation

In [4]:
df_performance_evaluation = pd.read_json(
    r"../datalake/landing/performance-evaluation/employee_performance_evaluation.json",
    orient="records",
    lines=True)

In [5]:
df_performance_evaluation.head()

   emp_id  satisfaction_level  last_evaluation
0   10001                  38               53
1   10002                  80               86
2   10003                  11               88
3   10004                  72               87
4   10005                  37               52

In [6]:
len(df_performance_evaluation['emp_id'].unique())

14999

### Create column Number_Project

#### Inspect projects_emp

In [7]:
query = """SELECT * FROM projects_emp"""
projects_emp = pd.read_sql(query, engine)

In [8]:
# The id of employee and the projects they worked in
projects_emp.head()

   EMP_ID  PROJECT_ID
0   10001         100
1   10001         227
2   10002         308
3   10002         103
4   10002         285

In [9]:
projects_emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57042 entries, 0 to 57041
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EMP_ID      57042 non-null  int64
 1   PROJECT_ID  57042 non-null  int64
dtypes: int64(2)
memory usage: 891.4 KB

In [10]:
len(projects_emp['EMP_ID'].unique())

14999

#### Select the number of projects of each employee

In [11]:
query = """SELECT Count(PROJECT_ID) as number_projects, emp_id
FROM projects_emp
GROUP BY (emp_id);"""

In [12]:
df_number_projects = pd.read_sql(query,engine)

In [13]:
df_number_projects.head()

   number_projects  emp_id
0                2   10001
1                5   10002
2                7   10003
3                5   10004
4                2   10005

### Create columns **Mean_Work_Last_3_Months**.

In [104]:
df_sistema_ponto = pd.DataFrame(data=None, columns=["emp_id","data","hora"])
df_sistema_ponto.head()

Empty DataFrame
Columns: [emp_id, data, hora]
Index: []

#### Load the worked hours

In [105]:
for sheet in glob.glob(r"../datalake/landing/working-hours/*.xlsx"):
    df_ = pd.read_excel(sheet)
    # Concat current df with the one from last iteration
    df_sistema_ponto = pd.concat([df_sistema_ponto,df_])

In [106]:
df_sistema_ponto.head()

    emp_id       data  hora
0  20001.0 2020-05-31  10.0
1  20001.0 2020-06-01  11.0
2  20001.0 2020-06-02   4.0
3  20001.0 2020-06-03   7.0
4  20001.0 2020-06-04   7.0

In [17]:
df_sistema_ponto.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3225000 entries, 0 to 537499
Data columns (total 3 columns):
 #   Column  Dtype
---  ------  -----
 0   emp_id  float64
 1   data    datetime64[ns]
 2   hora    float64
dtypes: datetime64[ns](1), float64(2)
memory usage: 98.4 MB

#### Convert to datetime

In [18]:
df_sistema_ponto["hora"] = pd.to_numeric(df_sistema_ponto["hora"])

#### Filter registers from last three months

In [114]:
df_sistema_ponto['data'].max()

Timestamp('2020-12-31 00:00:00')

In [27]:
df_sistema_ponto.min()

emp_id                10001.0
data      2020-05-31 00:00:00
hora                      4.0
dtype: object

In [116]:
three_months_ago = df_sistema_ponto['data'].max() - pd.DateOffset(months=3)

In [117]:
df_last_3_month = df_sistema_ponto[(df_sistema_ponto['data'] > three_months_ago)]

In [118]:
df_last_3_month.head()

      emp_id       data  hora
123  20001.0 2020-10-01   7.0
124  20001.0 2020-10-02  13.0
125  20001.0 2020-10-03  13.0
126  20001.0 2020-10-04   5.0
127  20001.0 2020-10-05   6.0

#### Calculating the average value of the amount of worked hours on a month in the last 3 months

In [28]:
mean_work_last_3_months = df_last_3_month.groupby("emp_id")["hora"].agg("sum")/3

In [33]:
mean_work_last_3_months = pd.DataFrame(data=mean_work_last_3_months)

In [34]:
mean_work_last_3_months.rename(columns={"hora":"mean_work_last_3_months"},inplace=True)

In [35]:
mean_work_last_3_months.head()

         mean_work_last_3_months
emp_id
10001.0               266.000000
10002.0               252.000000
10003.0               289.666667
10004.0               275.666667
10005.0               292.333333

### Create column Time_in_Company

#### Setting a reference date

In [56]:
date_referencia = df_sistema_ponto['data'].max().date()

In [119]:
date_referencia

datetime.date(2020, 12, 31)

#### Setting the query

In [64]:
query = """SELECT hire_date FROM employees;"""

In [65]:
df_hire_date = pd.read_sql_query(query,engine)

In [66]:
df_hire_date.head()

    hire_date
0  2018-01-17
1  2015-02-02
2  2017-01-22
3  2016-01-28
4  2018-01-17

In [61]:
df_hire_date["hire_date"] = pd.to_datetime(df_hire_date["hire_date"])

#### Calculate the difference in days from the employee's hiring date to the reference date

In [63]:
days_diff = []
for d in df_hire_date["hire_date"]:
    diff = date_referencia - d.date()
    days_diff.append(diff.days)

#### Convert the number of days to the number of years.

In [67]:
nyears = [round(ndays / 365) for ndays in days_diff]

In [68]:
df_hire_date["time_in_company"] = nyears

In [69]:
df_hire_date.head()

    hire_date  time_in_company
0  2018-01-17                3
1  2015-02-02                6
2  2017-01-22                4
3  2016-01-28                5
4  2018-01-17                3

### Create Work_Accident column

In [74]:
df_employees = pd.read_sql_table("employees",engine)

In [75]:
df_accident = pd.read_sql_table("accident",engine)

In [76]:
df_employees.head()

   emp_no birth_date first_name last_name gender department  left   hire_date
0   10001 1953-09-02     Georgi   Facello      M      sales     1  2018-01-17
1   10002 1964-06-02    Bezalel    Simmel      F      sales     1  2015-02-02
2   10003 1959-12-03      Parto   Bamford      M      sales     1  2017-01-22
3   10004 1954-05-01  Chirstian   Koblick      M      sales     1  2016-01-28
4   10005 1955-01-21    Kyoichi  Maliniak      M      sales     1  2018-01-17

In [77]:
df_accident.head()

,emp_no,Event Description,Event Keywords,Human Factor
0,10019,"EMPLOYEE IS ELECTROCUTED, FALLS FROM A LADDER,...","RIB,ELECTRICAL,FRACTURE,LADDER,FALL",Other
1,10069,EMPLOYEE FALLS THROUGH HOLE IN ROOF AND IS KILLED,"SLIP,FALL PROTECTION,ROOF,FALL",Safety Devices Removed/Inoperable
2,10121,EMPLOYEE IS ASPHYXIATED INSIDE MANHOLE AND IS ...,"ASPHYXIATED,CONFINED SPACE,HYDROGEN SULFIDE,ME...",Insufficient /Lack/Respiratory Protection
3,10124,EMPLOYEE DIES FROM NATURAL CAUSES AFTER FALL A...,0,Other
4,10137,EMPLOYEE AMPUTATES FINGERS WHILE CLEANING MACH...,"CAUGHT IN,AMPUTATED,FAN BLADE,AMPUTATION,LOCKO...","Misjudgment, Hazardous Situation"

#### Check which employees had an accident.

In [95]:
work_accident = []
for emp in df_employees["emp_no"]:
    if emp in df_accident["emp_no"].to_list():
        work_accident.append(1)
    else:
        work_accident.append(0)

In [96]:
# work_accident = {}
# for emp in df_employees["emp_no"]:
#    if emp in df_accident["emp_no"].unique():
#        work_accident[emp] = 1
#    else:
#        work_accident[emp] = 0

In [97]:
df_work_accident = pd.DataFrame(data=None, columns=["work_accident"])

In [98]:
df_work_accident["work_accident"] = work_accident

In [99]:
df_work_accident.head()

   work_accident
0              0
1              0
2              0
3              0
4              0

### Create columns Department, Salary e Left

In [100]:
query = """SELECT emp.department as department,sal.salary as salary, emp.left
FROM employees emp
INNER JOIN salaries sal
ON emp.emp_no = sal.emp_id;
"""

In [101]:
df_department_salary_left = pd.read_sql_query(query,engine)

In [102]:
df_department_salary_left.head()

  department  salary  left
0      sales     low     1
1      sales  medium     1
2      sales  medium     1
3      sales     low     1
4      sales     low     1